{
  "backend/main.mo": "Motoko backend actor that manages user characters with CRUD operations (add, get, delete) and provides sample characters, storing data per Principal in a Map.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: automatic saving of story text to localStorage every 10 seconds and visual feedback for autosave status.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and contexts for the First Edition novella writing platform.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point for the First Edition app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 9 routes, ThemeProvider, ProjectProvider, and Toaster for notifications.",
  "frontend/src/components/AutosaveIndicator.tsx": "Visual feedback component displaying autosave status with animated icons for 'saving' (spinner) and 'saved' (checkmark) states.",
  "frontend/src/components/CharacterCard.tsx": "Character display card with background image, edit/delete buttons, and sections for traits and relationships with badge styling.",
  "frontend/src/components/CharacterForm.tsx": "Form component for creating/editing characters with fields for name, description, traits (with add/remove), and relationships, submitting via useAddCharacter hook.",
  "frontend/src/components/DictionaryTool.tsx": "A dictionary lookup component that allows users to search for word definitions, displaying phonetics, parts of speech, definitions, and examples in a scrollable card interface.",
  "frontend/src/components/ExportPdfButton.tsx": "A button component that exports the current project story to PDF format, disabled when the story text is empty or export is in progress.",
  "frontend/src/components/FlipbookViewer.tsx": "An interactive flipbook viewer that displays story pages with images and text, supporting keyboard navigation and page-turning animations with a book-like visual design.",
  "frontend/src/components/GoogleSearchTool.tsx": "A mock Google search tool component that generates contextual search results based on keywords like space, ocean, or dinosaurs for educational research purposes.",
  "frontend/src/components/Layout.tsx": "The main application layout wrapper providing header with branding, navigation, main content area, and footer with attribution to caffeine.ai.",
  "frontend/src/components/Navigation.tsx": "A sticky navigation bar with links to all app sections (Write, About, Prompts, Characters, Images, Preview, Grammar, Writer's Block, Flipbook) plus action buttons for saving, exporting, and theme toggling.",
  "frontend/src/components/SaveButton.tsx": "A button component that saves the current project to browser storage and displays a success toast notification.",
  "frontend/src/components/SaveFlipbookButton.tsx": "A button that saves the current story as a flipbook format and navigates to the flipbook viewer page, with loading state and validation for title and story text.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using animated sun and moon icons.",
  "frontend/src/components/ThesaurusTool.tsx": "A thesaurus lookup component that searches for and displays synonyms as clickable badges in a card interface.",
  "frontend/src/contexts/ProjectContext.tsx": "React context provider that manages project state (story text, title, images) with auto-save to localStorage and flipbook generation functionality. Provides methods to update project data, save/clear projects, and convert stories into paginated flipbooks.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication using Internet Identity. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAutosave.ts": "Custom hook implementing debounced autosave logic that triggers a save callback after user stops typing. Returns autosave status ('idle', 'saving', 'saved') for UI feedback with a 3-second saved indicator.",
  "frontend/src/hooks/useDictionary.ts": "Hook that fetches word definitions from the Free Dictionary API, returning phonetic info, parts of speech, and definitions with examples. Manages loading and error states for dictionary lookups.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow and identity persistence. Provides authentication status, identity object, and methods to login and clear identity.",
  "frontend/src/hooks/useLocalStorage.ts": "Simple hook providing type-safe localStorage operations (setItem, getItem, removeItem) with JSON serialization and error handling.",
  "frontend/src/hooks/usePdfExport.ts": "Hook that exports project content to PDF by opening a print dialog with formatted HTML including story text and images. Handles image loading and provides export status feedback.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for character management (get, add, delete characters and sample characters) using the backend actor. Handles query invalidation and caching.",
  "frontend/src/hooks/useThesaurus.ts": "Hook that fetches synonyms for words from the Free Dictionary API, extracting and deduplicating up to 10 synonyms. Manages loading and error states for thesaurus lookups.",
  "frontend/src/hooks/useWordCount.ts": "Memoized hook that counts words in text by splitting on whitespace and filtering empty strings.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors (background, foreground, primary, etc.) and utility classes for story and writing fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Landing page displaying platform features (writing, prompts, characters, images, grammar, export) with hero banner and call-to-action for grade 4 students.",
  "frontend/src/pages/CharacterDevelopmentPage.tsx": "Character management page with grid display, add/edit dialog, and empty state; uses custom hooks for CRUD operations.",
  "frontend/src/pages/FlipbookPage.tsx": "Displays saved flipbook with FlipbookViewer component or shows empty state with link to writing page if no flipbook exists.",
  "frontend/src/pages/GrammarCheckPage.tsx": "Grammar checking tool that simulates analysis of story text, detecting capitalization and repeated word issues with explanations.",
  "frontend/src/pages/ImageCreationPage.tsx": "AI image generation interface using text prompts; simulates generation with placeholder images that can be added to the story.",
  "frontend/src/pages/PreviewPage.tsx": "Displays formatted story preview with title, paragraphs, and illustrations in a book-like layout or shows empty state.",
  "frontend/src/pages/WritersBlockPage.tsx": "Generates creative writing suggestions based on existing story content to help overcome writer's block with randomized prompts.",
  "frontend/src/pages/WritingPage.tsx": "Main writing interface with title input, story textarea (2000 word limit), word count display, autosave indicator, and integrated dictionary/thesaurus/search tools in a sidebar layout.",
  "frontend/src/pages/WritingPromptsPage.tsx": "Displays categorized writing prompts (Adventure, Mystery, Fantasy, Friendship, Science Fiction) in a grid of cards to inspire grade 4 students' story writing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking features, known issues (word count enforcement, autosave, file reopening bugs), architectural notes for a grade 4 novella writing platform with local storage and PDF export."
}