{
  "backend/main.mo": "Motoko actor defining Character and Flipbook types with CRUD operations for user-specific character management (add, get, delete, sort by name) and sample character data.",
  "feature_evidence.json": "Feature evidence report documenting the 2000-word limit implementation on WritingPage with 'X / 2000' format display.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend files including pages, components, hooks, and configuration files for the First Edition novella writing application.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark theme modes.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the First Edition application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all page routes (writing, about, prompts, characters, preview, grammar, writer's block, images, flipbook), ThemeProvider, ProjectProvider, and Toaster.",
  "frontend/src/components/CharacterCard.tsx": "Character display card component with styled background image, showing name, description, traits badges, relationships, and edit/delete action buttons.",
  "frontend/src/components/CharacterForm.tsx": "Form component for creating/editing characters with inputs for name, description, and dynamic lists for traits and relationships with add/remove functionality.",
  "frontend/src/components/DictionaryTool.tsx": "Dictionary lookup card component with search input that displays word definitions, phonetics, parts of speech, and usage examples in a scrollable area.",
  "frontend/src/components/ExportPdfButton.tsx": "Button component that triggers PDF export of the project using the usePdfExport hook, disabled when story text is empty or export is in progress.",
  "frontend/src/components/FlipbookViewer.tsx": "Displays an interactive flipbook with page navigation, showing images and text content with page-turning animations and keyboard controls.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header, navigation, footer, and outlet for nested routes.",
  "frontend/src/components/Navigation.tsx": "Navigation bar with links to all app sections (Write, Prompts, Characters, Images, etc.) and action buttons for saving, exporting, and theme toggling.",
  "frontend/src/components/SaveButton.tsx": "Button component that saves the current project to browser local storage and displays a success toast notification.",
  "frontend/src/components/SaveFlipbookButton.tsx": "Button that saves the current story as a flipbook and navigates to the flipbook viewer page, with loading state and validation.",
  "frontend/src/components/ThemeToggle.tsx": "Toggle button for switching between light and dark themes using next-themes.",
  "frontend/src/components/ThesaurusTool.tsx": "Card component with search input that looks up synonyms for words and displays them as badges.",
  "frontend/src/contexts/ProjectContext.tsx": "React context providing project state management including story text, title, images, and flipbook creation/persistence using local storage.",
  "frontend/src/hooks/useActor.ts": "Hook for managing Internet Identity authentication and creating backend actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useDictionary.ts": "Hook that fetches word definitions from the Free Dictionary API with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook that wraps localStorage operations (setItem, getItem, removeItem) with JSON serialization and error handling.",
  "frontend/src/hooks/usePdfExport.ts": "Hook for exporting project data to PDF by opening a print dialog with formatted HTML content including story text and images.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing character data (get, add, delete) and sample characters, using the backend actor from useActor.",
  "frontend/src/hooks/useThesaurus.ts": "Hook that fetches synonyms for words using the dictionaryapi.dev API, returning up to 10 unique synonyms with loading and error states.",
  "frontend/src/hooks/useWordCount.ts": "Memoized hook that counts words in a text string by splitting on whitespace.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes, including color variables for UI components and custom font utilities for story and writing styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "Landing page explaining First Edition features for grade 4 students, showcasing writing tools, character creation, image generation, and export capabilities.",
  "frontend/src/pages/CharacterDevelopmentPage.tsx": "Page for creating and managing story characters with a grid display, add/edit dialog, and integration with character query hooks.",
  "frontend/src/pages/FlipbookPage.tsx": "Displays saved flipbook or prompts user to create one from the writing page, rendering FlipbookViewer component when flipbook data exists.",
  "frontend/src/pages/GrammarCheckPage.tsx": "Provides a grammar checking interface that analyzes the story text for basic issues like missing capital letters and repeated words, displaying up to 10 suggestions with explanations.",
  "frontend/src/pages/ImageCreationPage.tsx": "Allows users to generate story illustrations by entering text prompts, simulates AI image generation with placeholder images, and enables adding generated images to the project.",
  "frontend/src/pages/PreviewPage.tsx": "Displays a formatted preview of the complete story with title, text content split into paragraphs, and any selected illustrations in a book-like layout.",
  "frontend/src/pages/WritersBlockPage.tsx": "Helps writers overcome creative blocks by generating random story continuation suggestions based on the current story content.",
  "frontend/src/pages/WritingPage.tsx": "Main writing interface with title input and story textarea (2000 word limit), displays word count, and includes sidebar tools for dictionary and thesaurus.",
  "frontend/src/pages/WritingPromptsPage.tsx": "Displays categorized writing prompts across five genres (Adventure, Mystery, Fantasy, Friendship, Science Fiction) to inspire story ideas.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including container, border radius, shadows, and accordion animations, with typography, container queries, and animate plugins.",
  "project_state.json": "Project state document describing First Edition, a novella writing platform for grade 4 students with features including writing prompts, image creation, character development, grammar check, word count tracking, dark mode, save/load, PDF export, and AI-powered writing assistance."
}