{
  "backend/main.mo": "Motoko actor defining Character and Flipbook types with CRUD operations for user-specific character management (add, get, delete, getByName) and sample character data.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: replacing neutral color scheme with blue/red/white OKLCH palette in CSS variables, and updating all component styles to reflect the new color scheme.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components, pages, hooks, and contexts with emphasis on calligraphic styling, blue/red/white color scheme, and project management functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, currently using neutral grayscale values (0 chroma) for most colors except destructive and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the 'First Edition' application.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with 9 routes (writing, about, prompts, characters, preview, grammar, writers-block, image-creation, flipbook), ThemeProvider, ProjectProvider, and Toaster.",
  "frontend/src/components/AutosaveIndicator.tsx": "Status indicator component displaying save state (idle/pending/saving/saved) with icons, progress bar, and primary color styling.",
  "frontend/src/components/CharacterCard.tsx": "Card component displaying character details with gradient backgrounds, primary/destructive color accents, edit/delete buttons, and badges for traits and relationships.",
  "frontend/src/components/CharacterForm.tsx": "Form component for creating/editing characters with inputs for name, description, traits, and relationships, featuring add/remove functionality for list items.",
  "frontend/src/components/DictionaryTool.tsx": "A dictionary lookup component that allows users to search for word definitions using the useDictionary hook and displays the first definition found.",
  "frontend/src/components/ExportPdfButton.tsx": "A button component that exports the current project story text to PDF using the browser's print dialog, with loading states and toast notifications.",
  "frontend/src/components/FlipbookViewer.tsx": "A paginated viewer component that displays flipbook pages with images and text content, including navigation controls to move between pages.",
  "frontend/src/components/GoogleSearchTool.tsx": "A simple research tool component that opens Google search in a new tab with the user's query.",
  "frontend/src/components/Layout.tsx": "The main application layout component with header, navigation, footer, and outlet for nested routes, including branding and Caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "The main navigation bar component with links to all app sections (Write, Prompts, Characters, etc.) and action buttons for Save, Export PDF, and Theme Toggle.",
  "frontend/src/components/SaveButton.tsx": "A button component that triggers project save functionality from ProjectContext and displays a success toast notification.",
  "frontend/src/components/SaveFlipbookButton.tsx": "A button component that saves the current story as a flipbook and navigates to the flipbook view, with loading states and validation.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes, with animated sun/moon icons.",
  "frontend/src/components/ThesaurusTool.tsx": "A thesaurus lookup component that searches for synonyms using the useThesaurus hook and displays them as badges.",
  "frontend/src/contexts/ProjectContext.tsx": "A React context provider that manages project state (story text, title, images, flipbook) with localStorage persistence and provides CRUD operations for project data.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAutosave.ts": "Custom React hook that implements debounced autosave functionality with progress tracking, triggering a save callback after a configurable delay when data changes. Returns autosave status ('idle', 'saving', 'saved') and progress percentage for UI feedback.",
  "frontend/src/hooks/useDictionary.ts": "React hook that fetches word definitions from the Free Dictionary API, returning phonetic information, parts of speech, definitions, and examples. Manages loading and error states for dictionary lookups.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login/logout flow, identity persistence, and delegation validation. Provides authentication status, identity object, and login/clear methods to child components.",
  "frontend/src/hooks/useLocalStorage.ts": "Simple React hook providing type-safe wrapper functions for localStorage operations (setItem, getItem, removeItem) with JSON serialization and error handling.",
  "frontend/src/hooks/usePdfExport.ts": "React hook that exports project data to PDF by opening a formatted print dialog window with story text, title, and illustrations. Generates print-ready HTML with custom styling for manuscript-style layout.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing character data from the backend canister, including queries for fetching characters and sample characters, plus mutations for adding and deleting characters. Handles cache invalidation on mutations.",
  "frontend/src/hooks/useThesaurus.ts": "React hook that fetches synonyms for a given word using the Free Dictionary API, extracting and deduplicating synonyms from word definitions. Returns up to 10 unique synonyms with loading and error states.",
  "frontend/src/hooks/useWordCount.ts": "Simple React hook that calculates and memoizes word count from text by splitting on whitespace.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, importing Google Fonts (Dancing Script, Playfair Display, Great Vibes), and defining utility classes for typography styles. Sets up design tokens for colors, spacing, and component styling.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/AboutPage.tsx": "Landing page displaying platform overview, six key features (document editor, prompts, characters, images, grammar, export), and a call-to-action to get started.",
  "frontend/src/pages/CharacterDevelopmentPage.tsx": "Character management page with CRUD operations: displays character cards in a grid, opens a dialog for adding/editing characters via CharacterForm, and handles deletion with confirmation.",
  "frontend/src/pages/FlipbookPage.tsx": "Displays an interactive flipbook viewer if pages exist, otherwise shows an empty state prompting users to add content and images.",
  "frontend/src/pages/GrammarCheckPage.tsx": "Grammar checking interface with a textarea for input and mock analysis that displays categorized issues (errors, warnings, suggestions) after a simulated check.",
  "frontend/src/pages/ImageCreationPage.tsx": "Image generation page where users enter prompts to create images (mock implementation using picsum.photos), then displays all generated images in a grid.",
  "frontend/src/pages/PreviewPage.tsx": "Project preview page that displays the story text and associated images in a formatted layout, showing empty states if no content exists.",
  "frontend/src/pages/WritersBlockPage.tsx": "Writer's block helper that displays three random writing suggestions from a pool of six, with a refresh button to shuffle and get new suggestions.",
  "frontend/src/pages/WritingPage.tsx": "Main writing editor page with title input, textarea for story content (2000 word limit), real-time word count display, autosave functionality (500ms delay), and integrated dictionary, thesaurus, and Google search tools in a sidebar.",
  "frontend/src/pages/WritingPromptsPage.tsx": "Displays a grid of creative writing prompts categorized by genre (Adventure, Mystery, Fantasy, Science Fiction, Drama, Romance) to inspire grade 4 students with story starters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (calligraphic, elegant, signature), OKLCH color system with theme variables, custom shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking the novella writing platform for grade 4 students, documenting features, known issues (word count limit bugs, save/autosave failures, localStorage persistence problems), and architectural decisions."
}