{
  "backend/main.mo": "Motoko actor defining Character and Flipbook types with CRUD operations for user-specific character management (add, get, delete, sort by name) and sample character data.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: Google search integration in WritingPage and a fix for the textarea word limit issue (9-word to 2000-word limit).",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, pages, hooks, and contexts for the First Edition writing platform.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining CSS variables for light and dark themes including background, foreground, primary, secondary, and chart colors.",
  "frontend/index.html": "HTML entry point for the First Edition app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with 9 routes (writing, about, prompts, characters, preview, grammar, writer's block, images, flipbook), ThemeProvider, ProjectProvider, and Toaster.",
  "frontend/src/components/CharacterCard.tsx": "Character display card component with background image, edit/delete buttons, and sections for traits and relationships using shadcn/ui components.",
  "frontend/src/components/CharacterForm.tsx": "Form component for creating/editing characters with name, description, traits (badge list), and relationships inputs, using React Query mutation for backend persistence.",
  "frontend/src/components/DictionaryTool.tsx": "Dictionary lookup tool with search input that fetches word definitions, phonetics, parts of speech, and examples from an API, displaying results in a scrollable card.",
  "frontend/src/components/ExportPdfButton.tsx": "A button component that exports the current project to PDF using the usePdfExport hook. Disabled when no story text exists or export is in progress.",
  "frontend/src/components/FlipbookViewer.tsx": "An interactive flipbook viewer component with page navigation (buttons and arrow keys), displaying pages with images and text content with flip animations. Shows page numbers and includes decorative styling.",
  "frontend/src/components/GoogleSearchTool.tsx": "A card component with a search input that opens Google search results in a new tab. Includes keyboard support for Enter key submission.",
  "frontend/src/components/Layout.tsx": "The main application layout component with header (logo and title), navigation, main content outlet, and footer with Caffeine.ai attribution. Uses TanStack Router for routing.",
  "frontend/src/components/Navigation.tsx": "A sticky navigation bar with links to all app sections (Write, About, Prompts, Characters, Images, Preview, Grammar, Writer's Block, Flipbook) plus action buttons (Save, Save Flipbook, Export PDF, Theme Toggle). Highlights active route.",
  "frontend/src/components/SaveButton.tsx": "A button component that saves the current project to local storage and displays a success toast notification.",
  "frontend/src/components/SaveFlipbookButton.tsx": "A button that saves the current project as a flipbook and navigates to the flipbook page. Disabled when title or story text is empty, shows loading state during save.",
  "frontend/src/components/ThemeToggle.tsx": "A button component that toggles between light and dark themes using next-themes, displaying sun/moon icons with smooth transitions.",
  "frontend/src/components/ThesaurusTool.tsx": "A card component with search input that looks up synonyms using the useThesaurus hook and displays results as badges. Shows error messages when no synonyms are found.",
  "frontend/src/contexts/ProjectContext.tsx": "React context providing project state management (story text, title, images) and flipbook functionality with local storage persistence. Includes methods for updating, saving, and clearing project data.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and manages an authenticated or anonymous actor based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useDictionary.ts": "A hook that fetches word definitions from the Free Dictionary API, returning word meanings, phonetics, and part of speech information with loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom hook that wraps localStorage operations (setItem, getItem, removeItem) with JSON serialization and error handling.",
  "frontend/src/hooks/usePdfExport.ts": "Hook for exporting project data to PDF by opening a print dialog with formatted HTML content including story text and illustrations.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing character data (get, add, delete) and sample characters, using the backend actor from useActor hook.",
  "frontend/src/hooks/useThesaurus.ts": "Hook that fetches synonyms for a given word using the dictionaryapi.dev API, returning up to 10 unique synonyms with loading and error states.",
  "frontend/src/hooks/useWordCount.ts": "Memoized hook that counts words in a text string by splitting on whitespace.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining colors for UI components (primary, secondary, accent, etc.) and custom font utilities for story and writing styles.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Landing page explaining the First Edition platform for grade 4 students, showcasing six key features (writing, prompts, characters, images, grammar, export) with icons and descriptions.",
  "frontend/src/pages/CharacterDevelopmentPage.tsx": "Page for creating and managing story characters with a grid display of character cards, add/edit dialog, and empty state prompting first character creation.",
  "frontend/src/pages/FlipbookPage.tsx": "Displays an interactive flipbook viewer if one exists, otherwise shows a prompt to create a flipbook from the writing page.",
  "frontend/src/pages/GrammarCheckPage.tsx": "Provides a grammar checking interface that analyzes story text for basic issues like capitalization and repeated words, displaying up to 10 suggestions with explanations.",
  "frontend/src/pages/ImageCreationPage.tsx": "Allows users to generate story illustrations by entering text prompts, simulating AI image generation with placeholder images that can be added to the project.",
  "frontend/src/pages/PreviewPage.tsx": "Displays a formatted preview of the complete story with title, text content, and selected illustrations in a book-like layout.",
  "frontend/src/pages/WritersBlockPage.tsx": "Generates creative writing suggestions based on the current story content to help students overcome writer's block with randomized prompts.",
  "frontend/src/pages/WritingPage.tsx": "Main writing interface with title and story text inputs, enforces a 2000-word limit, and includes sidebar tools for dictionary, thesaurus, and Google search.",
  "frontend/src/pages/WritingPromptsPage.tsx": "Displays categorized writing prompts across genres (Adventure, Mystery, Fantasy, Friendship, Science Fiction) to inspire story ideas for students.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines a custom design system with OKLCH color variables, extended theme settings including sidebar/chart colors, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting First Edition, a novella writing platform for grade 4 students with features like writing prompts, image creation, character development, grammar check, and PDF export. Currently tracking a known issue where word count limit is incorrectly enforcing 9 words instead of 2000 words."
}