{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update typography to calligraphic fonts with blue, red, and white color scheme",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Update global CSS typography to use calligraphic or script-style fonts for headings and decorative text elements",
      "acceptanceCriteria": [
        "Headings (h1, h2, h3) use calligraphic or script-style fonts",
        "Body text remains readable with appropriate font pairing",
        "Font choices are web-safe or properly imported from Google Fonts or similar service"
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Import calligraphic/script-style fonts from Google Fonts (e.g., Dancing Script, Great Vibes, or Pacifico for headings) and update the @layer base section to apply calligraphic fonts to h1, h2, h3 elements while maintaining readable body text with complementary font pairing. Update existing font utility classes to support the new typography system."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Replace current professional neutral color scheme with blue, red, and white palette using OKLCH format",
      "acceptanceCriteria": [
        "Primary colors use shades of blue",
        "Accent colors use shades of red",
        "Background and neutral elements use white and light tones",
        "Color variables maintain light and dark mode compatibility",
        "All color definitions use OKLCH format consistent with existing implementation"
      ],
      "file_operations": [
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Replace the existing OKLCH color system CSS custom properties with a blue, red, and white palette. Update --background to white/light tones, --primary to blue shades, --destructive/--accent to red shades, and --muted/--card to light neutrals. Maintain the existing CSS variable structure for light and dark modes while transitioning from the current neutral gray palette to the new color scheme. Ensure all OKLCH values maintain proper contrast ratios for accessibility."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Update the Tailwind theme color definitions to reference the new OKLCH CSS custom properties for blue, red, and white palette. Ensure sidebar colors and other extended theme colors align with the new color scheme."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Update component styles across all pages to reflect the new blue, red, and white color scheme consistently",
      "acceptanceCriteria": [
        "All pages display the new color scheme consistently",
        "Navigation and UI components use the updated colors",
        "Text remains readable with sufficient contrast ratios",
        "Interactive elements (buttons, links, inputs) use appropriate colors from the new palette"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Review the Layout component to ensure header, navigation wrapper, and footer utilize the updated CSS custom properties from the new blue, red, and white color scheme. Verify that text contrast meets accessibility standards with the new palette."
        },
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Update Navigation component styling to use the new blue primary colors for active route highlighting and interactive states. Ensure navigation links maintain readability with proper contrast against the new background colors."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Update AboutPage to reflect the new color scheme in the platform overview and feature grid. Ensure feature cards and headings display the calligraphic typography and blue/red/white palette consistently."
        },
        {
          "path": "frontend/src/pages/WritingPage.tsx",
          "operation": "modify",
          "description": "Update WritingPage editor interface to use the new color scheme for the textarea, sidebar tools, and word count display. Ensure calligraphic headings are applied and interactive elements use the blue and red accent colors appropriately."
        },
        {
          "path": "frontend/src/pages/CharacterDevelopmentPage.tsx",
          "operation": "modify",
          "description": "Update CharacterDevelopmentPage to display character cards with the new blue, red, and white color scheme. Ensure dialog components and action buttons reflect the updated palette."
        },
        {
          "path": "frontend/src/pages/PreviewPage.tsx",
          "operation": "modify",
          "description": "Update PreviewPage to display the project title with calligraphic typography and ensure the story text and image grid use the new color scheme for backgrounds and borders."
        },
        {
          "path": "frontend/src/pages/GrammarCheckPage.tsx",
          "operation": "modify",
          "description": "Update GrammarCheckPage card-based layout to use the new blue, red, and white palette for issue cards, badges, and accent colors while maintaining readability of grammar suggestions."
        },
        {
          "path": "frontend/src/pages/WritersBlockPage.tsx",
          "operation": "modify",
          "description": "Update WritersBlockPage suggestion cards to reflect the new color scheme with blue primary colors and red accents for emphasis."
        },
        {
          "path": "frontend/src/pages/ImageCreationPage.tsx",
          "operation": "modify",
          "description": "Update ImageCreationPage to use the new color scheme for the prompt input field and image grid display. Ensure interactive elements use appropriate blue and red accent colors."
        },
        {
          "path": "frontend/src/pages/WritingPromptsPage.tsx",
          "operation": "modify",
          "description": "Update WritingPromptsPage category cards to display with the new blue, red, and white color scheme while maintaining clear category differentiation."
        },
        {
          "path": "frontend/src/pages/FlipbookPage.tsx",
          "operation": "modify",
          "description": "Update FlipbookPage viewer controls and navigation buttons to use the new blue primary colors and ensure consistent color scheme application."
        },
        {
          "path": "frontend/src/components/CharacterCard.tsx",
          "operation": "modify",
          "description": "Update CharacterCard component to use the new blue, red, and white palette for card backgrounds, borders, and action buttons. Ensure calligraphic typography is applied to character names."
        },
        {
          "path": "frontend/src/components/AutosaveIndicator.tsx",
          "operation": "modify",
          "description": "Update AutosaveIndicator to use blue for the progress bar and success states, maintaining visibility against the new color scheme."
        },
        {
          "path": "frontend/src/components/ThemeToggle.tsx",
          "operation": "modify",
          "description": "Verify ThemeToggle button styling works correctly with the new blue, red, and white palette in both light and dark modes."
        }
      ]
    }
  ]
}