{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement autosave functionality for story text every 10 seconds",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Implement automatic saving of story text to localStorage every 10 seconds while typing",
      "acceptanceCriteria": [
        "Story text is automatically saved to localStorage every 10 seconds when user is actively typing",
        "Autosave timer resets when user types, preventing premature saves during active typing",
        "Autosave functionality works independently of the manual save button",
        "User can continue typing without interruption during autosave operations",
        "Autosaved data persists across page refreshes and browser sessions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAutosave.ts",
          "operation": "create",
          "description": "Create a custom hook that implements debounced autosave logic using useEffect. The hook accepts a callback function, data to save, and a delay (10000ms). It uses a debounce pattern where the timer resets on each data change, only triggering the save callback after the user stops typing for 10 seconds. Returns the autosave status ('idle', 'saving', 'saved') for UI feedback."
        },
        {
          "path": "frontend/src/pages/WritingPage.tsx",
          "operation": "modify",
          "description": "Integrate the useAutosave hook to automatically save storyText changes. Import and call useAutosave with the ProjectContext's saveProject method, the current storyText value, and 10000ms delay. Store the returned autosave status in local state to pass to the autosave indicator component. Ensure the autosave logic respects the existing local state management that prevents textarea flickering and does not interfere with manual save operations."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add visual feedback to inform users when story text has been automatically saved",
      "acceptanceCriteria": [
        "User sees a subtle indicator (e.g., 'Saved' text or icon) when autosave completes",
        "Feedback appears briefly and does not obstruct the writing interface",
        "Feedback is clear enough for grade 4 students to understand"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AutosaveIndicator.tsx",
          "operation": "create",
          "description": "Create a component that displays autosave status feedback. Accept a 'status' prop ('idle' | 'saving' | 'saved'). When status is 'saved', display a small, non-intrusive text indicator like 'Saved ✓' with a subtle fade-in animation. The indicator should automatically fade out after 2-3 seconds. Use simple, grade-4-friendly language. Style it to appear in a fixed position (e.g., near the word count) without obstructing the textarea. Use Tailwind CSS for styling with appropriate text colors from the theme."
        },
        {
          "path": "frontend/src/pages/WritingPage.tsx",
          "operation": "modify",
          "description": "Add the AutosaveIndicator component to the WritingPage layout. Position it near the word count display or in the header area where it's visible but not intrusive. Pass the autosave status from the useAutosave hook as a prop to the indicator component. Ensure the indicator placement works well with the existing sidebar tools and does not cause layout shifts."
        }
      ]
    }
  ]
}